title: WMI ActiveScript Consumer Execution
id: 95b02dbc-6f05-4d02-9244-e1a265f8cd9d
status: experimental
description: Phát hiện việc thực thi scrcons.exe, thường liên quan đến việc thực thi WMI ActiveScript Event Consumer
references:
    - https://attack.mitre.org/techniques/T1546/003/
author: khanh.tran
date: 2026-06-25
modified: 2026-06-25
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.003
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        - EventID: 1
            Image|endswith: '\scrcons.exe'
        - EventID: 4688
            NewProcessName|endswith: '\scrcons.exe'
    condition: selection
falsepositives: 
    - unknown
level: high