title: Sysmon - WMI Event Consumer and Binding Creation
id: 95b02dbc-6f05-4d02-9244-e1a265f8cd9d
status: experimental
description: Phát hiện hành vi WMI Event Subscription qua Sysmon bằng FilterToConsumerBinding hoặc EventConsumer
references:
    - https://attack.mitre.org/techniques/T1546/003/
author: khanh.tran
date: 2026-06-25
modified: 2026-06-25
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.003
logsource:
    product: windows
    category: wmi_event
detection:
    selection:
        - EventID: 21
        - EventID: 20
          Type:
              - 'Script'
              - 'Command Line'
    condition: selection
falsepositives: 
    - unknown
level: high